Осуществим подключение к бд

In [1]:
%load_ext sql
%sql sqlite:///lab_2.db

'Connected: None@lab_2.db'

Создадим таблицу студентов, групп, городов и факультетов

In [2]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer
    GPA number
);

drop table if exists Faculties;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 

Create table Groups
(

    id integer primary key,
name varchar(50)
);

drop table if exists Cities; 

Create table Cities
(
id integer primary key,
name varchar(50)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 1 
Перепишите создание таблиц с учетом наличия внешних ключей

In [3]:
%%sql 

/* drop table if exists Faculties;

CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 

CREATE TABLE Groups
(
id integer primary key,
name varchar(50)
);

drop table if exists Cities; 

CREATE TABLE Cities
(
id integer primary key,
name varchar(50)
);

drop table if exists Students;

CREATE TABLE Students
( 
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA number,
    foreign key (student_id) references Faculties(id),
    foreign key (student_id) references Groups(id),
    foreign key (student_id) references Cities(id)
); */

0 rows affected.

[]

In [10]:
%%sql 

drop table if exists Students_1;
drop table if exists Faculties_1;

CREATE TABLE Faculties_1
(
id integer primary key,
name varchar(50)
); 

drop table if exists Groups_1; 

CREATE TABLE Groups_1
(
id integer primary key,
name varchar(50)
);    

drop table if exists Cities_1; 

CREATE TABLE Cities_1
(
id integer primary key,
name varchar(50)
);  

CREATE TABLE Students_1
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA integer,
    foreign key (Faculty_id) references Faculties_1(id),
    foreign key (group_id) references Groups_1(id),
    foreign key (city_id) references Cities_1(id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [8]:
%%sql
PRAGMA foreign_keys = ON

Done.

[]


## Задание 2
Осуществить вставку во все таблицы с учетом правил на внешние ключи

In [11]:
%%sql 

   
    insert into Faculties_1 values(1, "PIH");
    insert into Faculties_1 values(2, "IТ");
    insert into Faculties_1 values(3, "KIB");
    insert into Faculties_1 values(4, "IТ");

    
    insert into Groups_1 values(101, "A101");
    insert into Groups_1 values(102, "B102");
    insert into Groups_1 values(103, "C103");

    
    insert into Cities_1 values(1, "Токио");
    insert into Cities_1 values(2, "Воронеж");
    insert into Cities_1 values(3, "Нью-Йорк");

    
    insert into Students_1 values(1, "Султанбек", 'Юсупов', 2, 1, 101, 4);
    insert into Students_1 values(5, "Рашид", 'Нуриев', 2, 1, 101, 6);
    insert into Students_1 values(2, "Ашот", 'Газимагомедов', 2, 2, 103, 21103);
    insert into Students_1 values(3, "Карен", 'Алиев', 3, 2, 102, 32102);
    insert into Students_1 values(4, "Фархад", 'Саидов', 1, 3, 101, 5);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql 
PRAGMA foreign_keys = ON

Done.

[]

## Задание 3
Вывести Имя Студента, Название его факультета, группы и города проживания

In [12]:
%%sql
select s.Name, f.name faculty, c.name city, g.name as "group"
from students_1 s 
JOIN faculties_1 f, cities_1 c, groups_1 g 
ON s.faculty_id=f.id and s.city_id=c.id and s.group_id=g.id;

Done.

[('Султанбек', 'IТ', 'Токио', 'A101'),
 ('Ашот', 'IТ', 'Воронеж', 'C103'),
 ('Карен', 'KIB', 'Воронеж', 'B102'),
 ('Фархад', 'PIH', 'Нью-Йорк', 'A101'),
 ('Рашид', 'IТ', 'Токио', 'A101')]

## Задание 4
Вывести имена всех студентов, обучающихся на факультет IT из Воронежа.

In [13]:
%%sql
select s.Name   , f.name faculty, c.name city, g.name as "group"
from students_1 s 
JOIN faculties_1 f, cities_1 c, groups_1 g 
ON s.faculty_id=f.id and s.city_id=c.id and s.group_id=g.id
WHERE f.name = "IТ" and c.name = "Воронеж";

Done.

[('Ашот', 'IТ', 'Воронеж', 'C103')]

## Задание 5
Для всевозможных пар (Факультет, Город) вывести количество студентов, соответствующее данной группе

In [14]:
%%sql
select MAX(f.name) faculty, MAX(c.name) city, count(1) as kolvo_studentov -- count(column_name) возвращ количество записей (строк) таблицы.
from students_1 s 
JOIN faculties_1 f, cities_1 c
ON s.faculty_id=f.id and s.city_id=c.id
GROUP BY f.id, c.id; -- GROUP BY используется для объединения результатов выборки по одному или нескольким столбцам.

Done.

[('PIH', 'Нью-Йорк', 1),
 ('IТ', 'Токио', 2),
 ('IТ', 'Воронеж', 1),
 ('KIB', 'Воронеж', 1)]

In [29]:
%%sql
select MAX(f.name) faculty, MAX(c.name) city, MAX(g.name) as "group", count(1) as student_number
from students_1 s 
JOIN faculties_1 f, cities_1 c, groups_1 g 
ON s.faculty_id=f.id and s.city_id=c.id and s.group_id=g.id
where g.name = 'A101'
GROUP BY f.id, c.id, g.id;

Done.

[('PIH', 'Нью-Йорк', 'A101', 1), ('IТ', 'Токио', 'A101', 2)]

## Задание 6 
Для всех групп вывести средний балл по группе для студентов, не проживающих в Москве, при условии, что количество таких студентов не менее 3

In [ ]:
cначала отфильтровать город, потом по среднему баллу, потом хевинг по количеству

In [39]:
%%sql
select s.Name, f.name faculty, c.name city, g.name as "group", s.GPA
from students_1 s 
JOIN faculties_1 f, cities_1 c, groups_1 g 
ON s.faculty_id=f.id and s.city_id=c.id and s.group_id=g.id
WHERE c.name != "Москва";

Done.

[('Султанбек', 'IТ', 'Токио', 'A101', 4),
 ('Ашот', 'IТ', 'Воронеж', 'C103', 21103),
 ('Карен', 'KIB', 'Воронеж', 'B102', 32102),
 ('Фархад', 'PIH', 'Нью-Йорк', 'A101', 5),
 ('Рашид', 'IТ', 'Токио', 'A101', 6)]

In [53]:
%%sql
SELECT AVG(GPA) as GPA_avg , MAX(city) city, MAX(gr) as "group", count(p.name) as s_count
FROM(
    select s.Name, f.name faculty, c.name city, g.name as gr, s.GPA GPA
    from students_1 s 
    JOIN faculties_1 f, cities_1 c, groups_1 g 
    ON s.faculty_id=f.id and s.city_id=c.id and s.group_id=g.id
    WHERE c.name != "Москва"
) p
GROUP BY  p.gr
HAVING count(p.name) >= 3 ;

Done.

[(5.0, 'Токио', 'A101', 3)]